Revit 2027 API
OpenOptions.GetOpenWorksetsConfiguration Method
 Gets the object used to configure the worksets to open when the model is opened.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WorksetConfiguration GetOpenWorksetsConfiguration()
Public Function GetOpenWorksetsConfiguration As WorksetConfiguration
public:
WorksetConfiguration^ GetOpenWorksetsConfiguration()
member GetOpenWorksetsConfiguration : unit -> WorksetConfiguration
Return Value
WorksetConfiguration
 The options. If null, all user-created worksets will be opened.
See Also
Reference
OpenOptions Class
Autodesk.Revit.DB Namespace